# Settings Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..Settings Property
Document Class See Also
---
Provides access to general application settings, such as Categories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Settings Settings { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Settings As Settings
	Get
```

Visual C++
---
```text
public:
property Settings^ Settings {
	Settings^ get ();
}
```

# Remarks
Returns an object that provides access to various settings within Autodesk Revit. The Settings property returns an object that provides access to the categories within the Autodesk Revit project.
# See Also
Document Class
Autodesk.Revit.DB Namespace